<template>
  <div class="contentBlock mb-5 mx-n075">
    <div class="row bg-white pl-3 pr-3 mb-3 justify-content-between">
      <div class="col-auto d-flex">
        <div class="f-14 tabsButton" :class="{'active': showTab===1 }" @click="_showTab(1);">
          Счета
        </div>
        <div class="f-14 tabsButton" :class="{'active': showTab===2 }" @click="_showTab(2);" >
          Закрывающие документы
        </div>
        <div class="f-14 tabsButton" :class="{'active': showTab===3 }" @click="_showTab(3);" >
          Договор
        </div>
      </div>
<!--      <div class="col-auto">-->
<!--        <div class="d-flex justify-content-start p-3">-->
<!--          <div class="button blueButton px-58">Скачать все</div>-->
<!--        </div>-->
<!--      </div>-->
    </div>
    <div class="row">
      <div v-if="showTab === 1" class="tabsBlock col-12">
        <div class="b-radius bg-white">
          <div class="d-flex align-items-center flex-wrap justify-content-between border-bottom p-3" v-for="invoice in invoices" :key="invoice.id" :id="invoice.id">
            <div class="d-flex align-items-center">
              <div>
                <div class="f-16 mb-1">
                  {{invoice.name}}
                </div>
                <div class="f-12 color-1">
                  2022/01/19-3214141-ind
                </div>
              </div>
              <div v-if="invoice.status === 0" class="maxWidthTablet tabletInfo noPay">Ждет оплату</div>
              <div v-if="invoice.status === 1"  class="maxWidthTablet tabletInfo okPay">Оплачен</div>
            </div>
            <div class="blockDropHeaderWrap">
              <a :href="invoice.url" target="_blank">
                <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                  <path d="M11.6023 14.0854C11.7078 14.1909 11.8508 14.2501 12 14.2501C12.1492 14.2501 12.2923 14.1909 12.3978 14.0854L15.3509 11.1323C15.4031 11.08 15.4446 11.018 15.4728 10.9498C15.5011 10.8815 15.5156 10.8084 15.5157 10.7345C15.5157 10.6606 15.5011 10.5875 15.4728 10.5192C15.4446 10.451 15.4031 10.389 15.3509 10.3367C15.2987 10.2845 15.2367 10.2431 15.1684 10.2148C15.1002 10.1865 15.027 10.172 14.9532 10.172C14.8793 10.172 14.8061 10.1865 14.7379 10.2148C14.6696 10.243 14.6076 10.2845 14.5554 10.3367L12.5625 12.3296V5.81055C12.5625 5.66136 12.5033 5.51829 12.3978 5.4128C12.2923 5.30731 12.1492 5.24805 12 5.24805C11.8508 5.24805 11.7078 5.30731 11.6023 5.4128C11.4968 5.51829 11.4375 5.66136 11.4375 5.81055V12.3296L9.44463 10.3367C9.39239 10.2845 9.33038 10.243 9.26213 10.2148C9.19388 10.1865 9.12073 10.172 9.04686 10.172C8.89768 10.172 8.7546 10.2312 8.64911 10.3367C8.54363 10.4422 8.48437 10.5853 8.48438 10.7345C8.48438 10.8837 8.54365 11.0268 8.64915 11.1323L11.6023 14.0854Z" fill="#6A7686"/>
                  <path d="M18.75 12C18.6008 12 18.4577 12.0593 18.3523 12.1648C18.2468 12.2702 18.1875 12.4133 18.1875 12.5625V17.625H5.8125V12.5625C5.8125 12.4133 5.75324 12.2702 5.64775 12.1648C5.54226 12.0593 5.39918 12 5.25 12C5.10082 12 4.95774 12.0593 4.85225 12.1648C4.74676 12.2702 4.6875 12.4133 4.6875 12.5625V17.625C4.68784 17.9233 4.80648 18.2092 5.01738 18.4201C5.22829 18.631 5.51424 18.7497 5.8125 18.75H18.1875C18.4858 18.7497 18.7717 18.631 18.9826 18.4201C19.1935 18.2092 19.3122 17.9233 19.3125 17.625V12.5625C19.3125 12.4133 19.2532 12.2702 19.1477 12.1648C19.0423 12.0593 18.8992 12 18.75 12Z" fill="#6A7686"/>
                  <rect x="0.5" y="0.5" width="23" height="23" rx="3.5" stroke="#EFF0F6"/>
                </svg>
              </a>
            </div>
          </div>
        </div>
      </div>
      <div v-if="showTab === 2" class="tabsBlock col-12" >

        <div class="b-radius bg-white">
          <div class="d-flex align-items-center flex-wrap justify-content-between border-bottom p-3" v-for="invoice in invoices" :key="invoice.id" :id="invoice.id">
            <div class="me-3">
              <div class="f-16 mb-1">
                {{invoice.name}}
              </div>
              <div class="f-12 color-1">

              </div>
            </div>
            <div class="blockDropHeaderWrap">
              <a :href="invoice.url" target="_blank">
                <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                  <path d="M11.6023 14.0854C11.7078 14.1909 11.8508 14.2501 12 14.2501C12.1492 14.2501 12.2923 14.1909 12.3978 14.0854L15.3509 11.1323C15.4031 11.08 15.4446 11.018 15.4728 10.9498C15.5011 10.8815 15.5156 10.8084 15.5157 10.7345C15.5157 10.6606 15.5011 10.5875 15.4728 10.5192C15.4446 10.451 15.4031 10.389 15.3509 10.3367C15.2987 10.2845 15.2367 10.2431 15.1684 10.2148C15.1002 10.1865 15.027 10.172 14.9532 10.172C14.8793 10.172 14.8061 10.1865 14.7379 10.2148C14.6696 10.243 14.6076 10.2845 14.5554 10.3367L12.5625 12.3296V5.81055C12.5625 5.66136 12.5033 5.51829 12.3978 5.4128C12.2923 5.30731 12.1492 5.24805 12 5.24805C11.8508 5.24805 11.7078 5.30731 11.6023 5.4128C11.4968 5.51829 11.4375 5.66136 11.4375 5.81055V12.3296L9.44463 10.3367C9.39239 10.2845 9.33038 10.243 9.26213 10.2148C9.19388 10.1865 9.12073 10.172 9.04686 10.172C8.89768 10.172 8.7546 10.2312 8.64911 10.3367C8.54363 10.4422 8.48437 10.5853 8.48438 10.7345C8.48438 10.8837 8.54365 11.0268 8.64915 11.1323L11.6023 14.0854Z" fill="#6A7686"/>
                  <path d="M18.75 12C18.6008 12 18.4577 12.0593 18.3523 12.1648C18.2468 12.2702 18.1875 12.4133 18.1875 12.5625V17.625H5.8125V12.5625C5.8125 12.4133 5.75324 12.2702 5.64775 12.1648C5.54226 12.0593 5.39918 12 5.25 12C5.10082 12 4.95774 12.0593 4.85225 12.1648C4.74676 12.2702 4.6875 12.4133 4.6875 12.5625V17.625C4.68784 17.9233 4.80648 18.2092 5.01738 18.4201C5.22829 18.631 5.51424 18.7497 5.8125 18.75H18.1875C18.4858 18.7497 18.7717 18.631 18.9826 18.4201C19.1935 18.2092 19.3122 17.9233 19.3125 17.625V12.5625C19.3125 12.4133 19.2532 12.2702 19.1477 12.1648C19.0423 12.0593 18.8992 12 18.75 12Z" fill="#6A7686"/>
                  <rect x="0.5" y="0.5" width="23" height="23" rx="3.5" stroke="#EFF0F6"/>
                </svg>
              </a>
            </div>
          </div>
        </div>
      </div>
      <div v-if="showTab === 3" class="tabsBlock col-12">
        <div class="b-radius bg-white">
          <div class="d-flex align-items-center flex-wrap justify-content-between border-bottom p-3" v-for="invoice in invoices" :key="invoice.id" :id="invoice.id">
            <div class="me-3">
              <div class="f-16 mb-1">
                {{ invoice.name }}
              </div>
              <div class="f-12 color-1">

              </div>
            </div>
            <div class="blockDropHeaderWrap">
              <a :href="invoice.url" target="_blank">
                <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                  <path d="M11.6023 14.0854C11.7078 14.1909 11.8508 14.2501 12 14.2501C12.1492 14.2501 12.2923 14.1909 12.3978 14.0854L15.3509 11.1323C15.4031 11.08 15.4446 11.018 15.4728 10.9498C15.5011 10.8815 15.5156 10.8084 15.5157 10.7345C15.5157 10.6606 15.5011 10.5875 15.4728 10.5192C15.4446 10.451 15.4031 10.389 15.3509 10.3367C15.2987 10.2845 15.2367 10.2431 15.1684 10.2148C15.1002 10.1865 15.027 10.172 14.9532 10.172C14.8793 10.172 14.8061 10.1865 14.7379 10.2148C14.6696 10.243 14.6076 10.2845 14.5554 10.3367L12.5625 12.3296V5.81055C12.5625 5.66136 12.5033 5.51829 12.3978 5.4128C12.2923 5.30731 12.1492 5.24805 12 5.24805C11.8508 5.24805 11.7078 5.30731 11.6023 5.4128C11.4968 5.51829 11.4375 5.66136 11.4375 5.81055V12.3296L9.44463 10.3367C9.39239 10.2845 9.33038 10.243 9.26213 10.2148C9.19388 10.1865 9.12073 10.172 9.04686 10.172C8.89768 10.172 8.7546 10.2312 8.64911 10.3367C8.54363 10.4422 8.48437 10.5853 8.48438 10.7345C8.48438 10.8837 8.54365 11.0268 8.64915 11.1323L11.6023 14.0854Z" fill="#6A7686"/>
                  <path d="M18.75 12C18.6008 12 18.4577 12.0593 18.3523 12.1648C18.2468 12.2702 18.1875 12.4133 18.1875 12.5625V17.625H5.8125V12.5625C5.8125 12.4133 5.75324 12.2702 5.64775 12.1648C5.54226 12.0593 5.39918 12 5.25 12C5.10082 12 4.95774 12.0593 4.85225 12.1648C4.74676 12.2702 4.6875 12.4133 4.6875 12.5625V17.625C4.68784 17.9233 4.80648 18.2092 5.01738 18.4201C5.22829 18.631 5.51424 18.7497 5.8125 18.75H18.1875C18.4858 18.7497 18.7717 18.631 18.9826 18.4201C19.1935 18.2092 19.3122 17.9233 19.3125 17.625V12.5625C19.3125 12.4133 19.2532 12.2702 19.1477 12.1648C19.0423 12.0593 18.8992 12 18.75 12Z" fill="#6A7686"/>
                  <rect x="0.5" y="0.5" width="23" height="23" rx="3.5" stroke="#EFF0F6"/>
                </svg>
              </a>
            </div>
          </div>
        </div>
      </div>
    </div>

  </div>

</template>

<script>
import authHeader from "@/services/auth-header";
import axios from "axios";

export default {
  name: "In pay",
  components: {


  },
  data() {
    return{
      showTab:1,
      invoices:null
    }
  },
  watch:{

  },
  methods: {
    _showTab(id){
      this.invoices = null;
      this.showTab = id;
      this.initDocs(id);
    },
    initDocs(type = 1){

      axios.post( 'http://panel.kdm1.biz/api/inpay/',
          {
            user_id: this.$route.params.id,
            type:type
          },
          {
            headers: authHeader()
          }
      ).then((resp) => {
        this.invoices = resp.data;
        console.log(resp.data);

      }).catch(function(error){
        console.log(error);

      }).finally(() => (this.loading = false));
    }
  },
  mounted() {
    this.initDocs();
  }
};
</script>
